Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/ced.en.utf8.tmx
Source language: en
Languages: chr

source: For what reason is he happy?
chr: ᎦᏙ ᎤᏰᏟᏗ ᎠᎵᎮᎵᎦ?

source: Friendship is important in the lives of people.
chr: ᎠᎵᎢ ᎤᎵᏍᎨᏓ ᏴᏫ ᎠᏁᎲᎢ.

source: Let's trade knives.
chr: ᎢᎾᎵᎢᏓ ᎭᏰᎵᏍᏗ.

source: I caught a rabbit yesterday, but it ran away from me. He escaped from jail.
chr: ᏥᏍᏚ ᏥᏂᏴᎲᎢ ᏒᎯ ᎠᏎᏅ ᎠᏆᎵᏘᎡᎸᎢ. ᏧᎾᏓᏍᏚᏗ ᎠᏯᎥ ᎤᎵᏘᏒᎢ.

source: I lost some gloves.
chr: ᏗᎵᏰᏑᎶ ᏓᎩᏲᎱᏏ.

source: When he goes swimming, he takes his ring off.
chr: ᏳᏓᏬᎡᎾ ᎠᎵᏰᏑᏍᏘᎩᏍᎪᎢ.

source: I am making a big ring.
chr: ᎤᏔᎾ ᎠᎵᏰᏑᏍᏙ ᎪᎸᏍᎦ.

source: She has a three hundred dollar ring on her finger.
chr: ᏦᎢᏥᏆ ᎠᏕᎸ ᏧᎬᏩᎵᏗ ᎠᎵᏰᏑᏍᏙ ᎤᎵᏰᏑᏍᏘᎦ.

source: He has on red socks.
chr: ᏗᎩᎦᎨ ᏗᎵᏲ ᏚᎵᏲᎭ.

source: Don't go around spitting.
chr: ᏞᏍᏗ ᏯᎵᏥᏈᏙᎮᏍᏗ.

source: Raise up awhile.
chr: ᎭᎵᏌᎳᏛᎦ ᏞᎦ.

source: She wants to shop for groceries.
chr: ᎠᎵᏍᏓᏴᏗ ᎤᏓᎾᏁᏒᎲᏍᏗ ᎤᏚᎵᎭ.

source: In the evening, he eats a big meal.
chr: ᏒᎯᏰᏱ ᎤᏔᎾ ᎠᎵᏍᏓᏴᎲᏍᎪᎢ.

source: The student asked for assistance.
chr: ᎠᎵᏍᏕᎸᏙᏗ ᎤᏔᏲᎲ ᏗᏕᎶᏆᏍᎩ.

source: He helps in the building of houses.
chr: ᎦᎵᏦᏕ ᏓᎾᏁᏍᎨᏍᎬ ᎠᎵᏍᏕᎵᏍᎪᎢ.

source: When he entered the house, he took off his cap.
chr: ᎦᎵᏦᏕ ᎤᏴᏝ ᎤᎵᏍᏚᎴᏒᎢ.

source: How long does it take when she washes her hair?
chr: ᎯᎳ ᎢᎪᎯᏓ ᎠᎯᎵᏙᎰ ᏳᎵᏍᏚᎴᎭ?

source: Put on a cap when you go out because it's cold outside.
chr: ᎭᎵᏍᏚᎳᏅ ᎯᏄᎪᏨᎢ, ᎤᎲᏜᎮᏃ ᏙᏱ.

source: Where did you get this cap?
chr: ᎭᏢ ᏣᏁᏎ ᎯᎠ ᎠᎵᏍᏚᎶ?

source: He sat down close to where the speaker was standing.
chr: ᎦᏬᏂᏍᎩ ᎦᏙᎬ ᎾᎥ ᎤᎵᏍᏛᏡᏅᎢ.

source: When something hit him in the eye, he shook his head.
chr: ᎪᎱᏍᏗ ᎤᏩᏂᎳ ᎠᎦᏙᎵ, ᎤᎵᏍᏛᏂᎸᎢ.

source: Some Cherokee girls like to dance.
chr: ᎢᎦᏓ ᎠᏂᏣᎳᎩ ᎠᏂᎨᏳᏣ ᎤᏂᎸᏉᏗ ᎤᎾᎵᏍᎩᏍᏗᎢ.

source: Permit me to speak.
chr: ᏍᏆᎵᏍᎪᎸᏓᏏ ᎠᎩᏬᏂᎮᏍᏗᎢ.

source: Nod your head if you accept.
chr: ᎭᎵᏍᎫᏯ ᏕᎭᏓᏂᎸᎨᏍᏗ.

source: I had just arrived when their speeches ended.
chr: ᎩᎳ ᎠᎩᎷᏨ ᎤᎵᏍᏆᏛ ᏓᏂᏬᏂᏍᎬᎢ.

source: A little boy is sticking his head out the window.
chr: ᏦᎳᏂ ᎤᎵᏍᏆᎷᏓ ᎤᏍᏗ ᎠᏧᏣ.

source: Take your hat off. Let me look at it.
chr: ᎭᎵᏍᏇᏚᎩ. ᏥᎪᎵᏯ.

source: When he goes to town, he puts on clean clothes and a good hat.
chr: ᏗᎦᏚᎲ ᏳᏪᎾ ᏧᏓᏅᎦᎸᏓ ᏓᎿᏬᏍᎪᎢ ᎣᏍᏓᏃ ᎠᎵᏍᏇᏚᏬ ᎠᎵᏍᏇᏚᎲᏍᎪᎢ.

source: How much did you pay for the hat?
chr: ᎯᎳ ᎢᎦ ᏣᏈᏴᎮ Ꮎ ᎠᎵᏇᏚᏬ?

source: What is he aiming to do?
chr: ᎦᏙ ᎤᏛᏁᏗ ᎠᎵᏐᏍᏗᎭ?

source: She likes to smell flowers.
chr: ᎠᏂᏥᎸᏍᎩ ᏧᎵᏒᏍᏙᏗ ᎤᎸᏉᏗ.

source: We get our drinking water from a spring.
chr: ᎦᏄᎪᎬ ᎣᏥᏁᎩᏍᎪ ᎠᎹ ᎣᎦᏗᏔᏍᏗ.

source: Get some salt when you go to town.
chr: ᎠᎹ ᎯᎩᏒ ᏗᎦᏚᎲ ᏪᏙᎸᎢ.

source: Who dug this water well?
chr: ᎦᎪ ᎤᏍᎪᏎᎢ ᎯᎠ ᎠᎹᏢᏗᎢ?

source: Fill the water bucket.
chr: ᎠᎹᏢᏙᏗ ᎯᎧᎵᏣ.

source: My home is in the United States.
chr: ᎠᎹᏰᏟ ᏗᏇᏅᏒ ᎠᏴ.

source: Jump into the water.
chr: ᎠᎹᏱ ᏫᏔᎵᏔᏚᎦ.

source: I found these shoes by the shore.
chr: ᎠᎹᏳᏟᏗ ᏓᎩᎾᏩᏛᎲ ᎯᎠ ᏗᎳᏑᎶ.

source: The fish in the ocean are big.
chr: ᎠᎺᏉ ᎠᏁᎯ ᎠᏣᏗ ᏧᎾᏔᎾ ᎨᏐᎢ.

source: She entered a beauty contest.
chr: ᏧᏃᏚᎯ ᎠᎾᏓᎪᎾᏘᏗᏍᎬ ᎤᏖᎳᏛᎢ.

source: A lot of people are gathering in town today.
chr: ᏥᏈᏍᏗ ᏴᏫ ᎠᎾᏓᏟᏏᎭ ᏗᎦᏚᎲ ᎪᎯ ᎢᎦ.

source: It's lightening too much to play outside.
chr: ᏥᏈᏍᏗ ᎠᎾᎦᎵᎭ ᏙᏱ ᏗᏁᎶᏗᎢ.

source: The dead battery couldn't start the car
chr: ᎤᎵᏬᏨ ᎠᎾᎦᎵᏍᎩ ᎤᏄᎸᏅ ᎤᏂᎩᏍᏙᏗ ᏓᏆᎴᎳ.

source: These five boys are all brothers.
chr: ᎯᎠ ᎯᏍᎩ ᎢᏯᏂᎢ ᎠᏂᏧᏣ ᏂᎦᏓ ᎠᎾᏟᏅᏟ.

source: This boy and girl want to go together.
chr: ᎯᎠ ᎠᎨᏳᏣ ᎠᏧᏣᏃ ᎤᎾᎵᎪᏗ ᎤᎾᏚᎵᎭ.

source: Little girls play with dolls.
chr: ᏧᎾᏍᏗ ᎠᏂᎨᏳᏣ ᏗᏁᏟᏗ ᏓᎾᏁᏟᏗᏍᎪᎢ.

source: He's trying to start the car.
chr: ᏓᏆᎴᎳ ᎤᏁᎩᏍᏙᏗ ᎠᏁᏟᏗᎭ.

source: My friend got married as soon as he turned eighteen.
chr: ᏁᎳᏚᏊ ᏄᏕᏘᏴᎭ ᎤᏁᎳᏛᎢ ᎣᎩᎾᎵᎢ.

source: Do you remember what I said long ago?
chr: ᎭᏅᏓᏗᎠᏍ ᎾᎩᏪᏒ ᎪᎯᎩᏴ ᏥᎨᏒ?

source: They grow a lot of strawberries in Stilwell.
chr: ᏥᏈᏍᏗ ᎠᏂ ᎠᎾᏛᎯᏍᏗᏍᎪ ᏍᏗᎳᏪᎵ.

source: They were standing for two hours.
chr: ᏔᎵ ᎢᏳᏟᎶᏓ ᎢᎪᎯᏓ ᎠᏂᏙᎾᎥᎢ.

source: At eleven o'clock last night, they were already asleep.
chr: ᏌᏚ ᎢᏳᏩᏂᎸ ᎤᏒ ᎦᏳᎳ ᎠᏂᏟᏅᎢ.

source: They sat quietly.
chr: ᎡᏝᏪ ᎠᏂᏅᎢ.

source: Her husband teaches at school.
chr: ᏧᎾᏕᏠᏆᏍᏗ ᏓᏕᏲᎲᏍᎪ ᎠᏂᏁᎵ.

source: I'm going to Mexico in the summer.
chr: ᎠᏂᏍᏆᏂ ᏓᎨᏏ ᎪᎩ ᎢᏴᎢ.

source: I was in the military service for three years.
chr: ᏦᎢ ᏧᏕᏘᏴᏓ ᎠᎩᏴᏢ ᎠᏂᏲᏍᎩᎢ.

source: My mother's birthday is May fifth.
chr: ᎠᏂᏍᎬᏘ ᎯᏍᎩᏁ ᎤᏕᏘᏱᏍᎩ ᎡᏥ.

source: Spring begins in the month of March.
chr: ᎠᏅᏱ ᎧᎸ ᎠᏓᎴᏂᏍᎪ ᎪᎨᏱ.

source: He set a trap for a raccoon but he didn't catch it.
chr: ᎬᏟ ᎤᏌᏛᏅ ᎠᏎᏅ Ꮭ ᏳᏁᏴᎮᎢ.

source: Raise the window.
chr: ᏦᎳᏂ ᎯᏌᎳᏛᎦ.

source: Who is smarter, you or your sister?
chr: ᎦᎪ ᎤᎪᏗ ᎠᏌᎹᏗᏯ, ᏂᎯ ᎡᏣᏙᎨ?

source: I want a new dress.
chr: ᎢᏤ ᎠᏌᏃ ᎠᏆᏚᎵ.

source: She's starching her husband's shirts.
chr: ᎠᏂᏁᎵ ᏧᎿᏬ ᏓᏍᏓᎦᏴᏗᎭ.

source: When he put the snake skin out in the sunshine, it became crisp.
chr: ᎠᎦᎵᏍᎬ ᏭᏅᎾ ᎢᎾᏓ ᎦᏁᎦ ᎤᏍᏓᎦᏴᏢᎢ.

source: Follow these lines.
chr: ᎯᎠ ᏓᏍᏓᏅᏅ ᏘᏍᏓᏩᏚᎦ.

source: He drew a line with a red pencil.
chr: ᎩᎦᎨ ᏗᎪᏪᎶᏗ ᎬᏗ ᎤᏍᏓᏅᎿᏅᎢ.

source: The little boy is following his father.
chr: Ꮎ ᎤᏍᏗ ᎠᏧᏣ ᎤᏙᏓ ᎠᏍᏓᏩᏕᎦ.

source: I am helping him build a house.
chr: ᎦᎵᏦᏕ ᎠᏁᏍᎨᏍᎬ ᏥᏍᏕᎵᎭ.

source: The girl is braiding her hair.
chr: ᎤᏍᏘᎬ ᎠᏍᏕᏲ ᎠᎨᏳᏣ.

source: He wants to eat a cucumber.
chr: ᎦᎦᎹ ᎤᏍᏗᎩᏍᏗ ᎤᏚᎵᎭ.

source: A pencil is not something to eat.
chr: ᏗᎪᏪᎶᏗ Ꮭ ᎠᏍᏗᎩᏍᏗ ᏱᎩ.

source: Do you want him to crush some rocks?
chr: ᏅᏯᏍ ᎤᏍᏙᏍᏗ ᏣᏚᎵ?

source: What happened to the crusher?
chr: ᎦᏙ ᎦᎵᏍᏓ ᎠᏍᏙᏍᎩᎢ?

source: The barber trims his son's hair.
chr: Ꮎ ᏗᏓᏍᏙᏰᏍᎩ ᎤᏪᏥ ᎠᏧᏣ ᎠᏍᏙᏰᏍᎪᎢ.

source: Close the door. If someone is drunk, he jails him.
chr: ᎯᏍᏚᎲᎦ ᎦᎶᎯᏍᏗᎢ. ᎤᏴᏍᏕᏓ ᏱᎩ ᎩᎶ ᎠᏍᏚᎲᏍᎪᎢ.

source: He opens the store at seven o'clock.
chr: ᎦᏟᏉᎩ ᎢᏳᏩᏂᎸ ᎠᏍᏚᎢᏍᎪ ᎠᏓᎾᏅᎢ.

source: He ate three sandwiches.
chr: ᏦᎢ ᏗᏍᏛᎭᏟ ᏚᎬᎢ.

source: He sandwiched it between the bread.
chr: ᎦᏚᎢ ᎤᏍᏛᎭᏝᏅᎢ.

source: Do you think it's going to snow? Maybe.
chr: ᏓᎫᏔᏂᏍ ᎮᎵᎠ? ᎠᏎᏛ.

source: I felt peculiar for awhile.
chr: ᎠᏎᎩ ᎠᏆᏓᏅᏓᏛ ᏞᎦ.

source: When he gets here show him where to park the car.
chr: ᎦᎷᏨ ᎯᏯᏎᎮᎸ ᎤᎿ ᎤᏗ ᏓᏆᎴᎳ.

source: I was going to go outside but it's too cold.
chr: ᏙᏱ ᏓᎨᏏᏒ ᎠᏎᏅ Ꮩ ᎤᏴᏜ.

source: He forgot to include my friend.
chr: ᎤᏩᎨᏫᏒ ᎤᏎᏍᏙᏗ ᎣᎩᎾᎵᎢ

source: He withdrew his candidacy for president.
chr: ᎤᎬᏫᏳᎯ ᏱᎦᎵᏍᏗᏍᎩ ᎨᏒ ᎤᏎᏒᎲᎢ.

source: The motion has been withdrawn.
chr: Ꮎ ᎠᏌᎳᏛ ᎠᏎᏒᏓ ᏂᎦᎵᏍᏓ.

source: When the boy broke the window, his father reprimanded him .
chr: ᎠᏧᏣ ᏦᎳᏂ ᎤᏲᏍᏔᎾ, ᎤᏙᏓ ᎤᏍᎦᏨᎢ.

source: I'm afraid of that big dog.
chr: Ꮎ ᎤᏔᎾ ᎩᏟ ᏥᏍᎦᎭ.

source: The dog tried to bite the man.
chr: ᎠᏍᎦᏯ ᎤᏍᎦᎵᏍᏗ ᎤᏁᏟᏔᏅ ᎩᏟ.

source: What is the biggest sin?
chr: ᎦᏙ ᎤᏍᏗ ᏭᏔᏅ ᎠᏍᎦᏂ?

source: Is there anyone living who is not a sinner?
chr: ᎩᎶᎢᏍ ᎡᎭ ᎠᏍᎦᎾ ᏂᎨᏒᎾ?

source: He doesn't want to commit a crime .
chr: Ꮭ ᎤᏍᎦᏅᎢᏍᏗ ᏳᏚᎵᎭ.

source: Do you recognize that man?
chr: ᎯᏲᎵᎦᏍ Ꮎ ᎠᏍᎦᏯ?

source: The woman said, "My husband is handsome."
chr: "ᎠᏍᎦᏰᎬᏍᏓ ᎣᏍᏗᏁᎵ," ᎤᏛᏅ ᎠᎨᏯ.

source: An officer is going to inspect the soldiers' uniforms .
chr: ᎠᏍᎦᏰᎬᏍᏓ ᏙᏛᎪᎵᏰᎢ ᎠᏂᏲᏍᎩ ᏚᎾᏄᏮᎢ.

source: What is the difference between a devil and Satan?
chr: ᎦᏙ ᎤᏍᏗ ᏚᏓᎴᎿᎠ ᎠᏍᎩᎾ, ᏎᏓᏂᏃ?

source: What did you dream about last night?
chr: ᎦᏙ ᎤᏍᏗ ᏣᏍᎩᏘᏎ ᎤᏒ ᏥᎨᏒᎢ?

source: A beaver makes a tree fall by gnawing it.
chr: ᎠᏍᎪᎩᏍᎬ ᎦᎴᏴᏍᏗᏍᎪ ᏡᎬ ᏙᏯ.

source: The little boy mourned for a dead dog.
chr: ᎤᏍᏗ ᎠᏧᏣ ᎩᏟ ᎤᎵᏬᏨ ᎤᏍᎪᏂᎸᎢ.

source: Rub my head, it hurts.
chr: ᏥᏍᎪᎵ ᎭᏍᎪᎵᏯ, ᎠᏇᎯᏍᏓᏁᎭ.

source: He erased his name on the paper.
chr: ᏚᏙᎥ ᎤᏍᎪᎸᏛ ᎪᏪᎵᎢ.

source: Hand me those erasers.
chr: Ꮎ ᏗᏍᎪᎸᏗᏍᏗ ᏗᏙᏍᎬᏏ.

source: The pretty color on the shirt is fading.
chr: ᎤᏬᏚᎯ ᎤᎵᏑᏫᏒ ᎠᎿᏬ ᎠᏍᎪᎸᎦ.

source: I am digging a water well.
chr: ᎠᎹᏢᏗ ᎦᏍᎪᏍᎦ.

source: He rubbed his shins when he stopped running.
chr: ᏗᏍᎬᏓᎨᏂ ᏚᏍᎪᎵᏰᎥ ᎤᎴᏫᏍᏔᎾ ᎠᏟᏒᎢ.

source: He finishes his work at 4:30.
chr: ᏅᎩ ᎠᏰᏟ ᎠᏍᏆᏗᏍᎪ ᏚᎸᏫᏍᏓᏁᎲᎢ.

source: His side is hurting from running.
chr: ᎠᏍᏆᎨᏂ ᎤᏪᎯᏍᏓᏁ ᎤᏓᎾᏫᏍᏔᏅᎢ.

source: When the ball was thrown to him, he caught it.
chr: ᏍᏆᏞᏍᏗ ᏩᎦᏗᏁᎳ ᎤᏍᏆᏞᏒᎢ.

source: He found a short pencil.
chr: ᎠᏍᏆᎳ ᏗᎪᏪᎶᏗ ᎠᏴᏩᏔ.

source: Whenever you sharpen a pencil, it becomes shorter.
chr: ᏗᎪᏪᎶᏗ ᏱᎦᏢᎭ ᎠᏍᏆᎶᎪᎢ.

source: The man broke an axe handle.
chr: Ꮎ ᎠᏍᎦᏯ ᎦᎷᏯᏍᏗ ᎫᎭᏟᏗ ᎤᏍᏆᎵᏒᎢ.

source: He tried to hit the dog on the head with a bat.
chr: ᎪᏍᏛᏂᏍᏗ ᎬᏗ ᎤᏍᏆᎸᏂᏍᏗ ᎩᏟ ᎤᏁᏟᏔᏅᎢ.

source: A lot of Mexicans live in Texas.
chr: ᏅᏓᎩ ᏥᏈᏍᏗ ᎠᏂᏍᏆᏂ ᎠᏁᎭ.

source: He was amazed at how fast his son learned to read.
chr: ᎤᏍᏆᏂᎪᏒ ᎾᎯᏗᏴ ᎤᏕᏠᏆᎥ ᎤᎪᎵᏰᏗ ᎤᏪᏥ ᎠᏧᏣ.

source: She's sucking on a ripe tomato.
chr: ᏔᎹᏟ ᎤᏩᏅᏒ ᎠᏍᏆᏄᏥᎦ.

source: When the dog attacked him, he hit it in the stomach with a stick.
chr: ᎩᏟ ᏚᎦᏘᎴᎾ ᎦᎾᏍᏓ ᎬᏗ ᎤᏍᏉᎭᎸᏂᎸᎢ.

source: He placed his hand on his friend's shoulder.
chr: ᎤᎾᎵᎢ ᎦᏅᏬ ᎤᏏᏔᏛᎢ.

source: He slapped me for no reason.
chr: ᎪᎱᏍᏗ ᏄᏰᏟᏛᎾ ᎠᏆᏏᏛᏂᎦ.

source: When I say back up, back up.
chr: ᎭᏏᏄᎦ ᎦᏛᏅ, ᎭᏏᏁᏒᎢ.

source: Why are you walking backwards?
chr: ᎦᏙ ᎠᏏᏂ ᏣᎢ?

source: One person spoke at the meeting.
chr: ᎠᏏᏴᏫ ᎤᏬᏂᏒ ᏓᎾᏠᏍᎬᎢ.

source: I shot a snake in the head with an arrow.
chr: ᎢᎾᏓ ᎠᏍᎪᎵ ᏥᏲᎸ ᎠᏟᏓ ᎬᏗ.

source: He roped a wild horse.
chr: ᏐᏈᎵ ᎨᏯᏔᎯ ᎤᏍᎳᏛᎢ.

source: He built a new fence around the garden.
chr: ᎢᏤ ᎤᏐᏯᎸ ᏠᎨᏏ.

source: The rooster is sitting on the fence.
chr: ᎠᏐᏴ ᎤᎩᎳ ᏥᏔᎦ ᎠᏨᏯ.

source: When his friend passed by, he waved to him.
chr: ᎤᎾᎵᎢ ᎤᎶᏌ ᎤᏐᎸᏓᎩᎡᎸᎢ.

source: Press down on it hard.
chr: ᏍᏓᏯ ᎭᏐᏅᏍᏓ.

source: The man was wounded fighting in a war.
chr: ᏓᎿᏩ ᎠᏟᎲ ᎠᏥᏐᏅᏁ ᎠᏍᎦᏯ.

source: How long a string do you want?
chr: ᎯᎳ ᎢᎦᏅᎯᏓ ᎠᏍᏘ ᏣᏚᎵ?

source: I am sopping gravy.
chr: ᎠᏑᏍᏗ ᎦᏑᎠ.

source: Where is he fishing?
chr: ᎭᏢᏴ ᎠᏑᎲᏍᎦ?

source: What color are you going to paint the house?
chr: ᎦᏙ ᎤᏍᏗ ᎤᎵᏑᏫᏓ ᏘᏑᏫᏍ ᎦᎵᏦᏕ?

source: Whenever he is going to work in the garden, he changes his pants.
chr: ᏠᎨᏏ ᏱᏙᏓᏳᎸᏫᏍᏓᏁᎵ, ᎠᏑᎳᎢᏴᏍᎪᎢ.

source: When he tore his pants while crossing over a fence, he took them off and mended them.
chr: ᎠᏏᎳᏛ ᎠᏓᏬᎯᎳᏗᏍᎬ ᎤᏲᏍᏔᎾ ᎤᏑᎶ ᎤᏑᎴᏒ ᎣᏍᏓ ᏄᏩᏁᎸᎢ.

source: He put on someone else's pants.
chr: ᏄᏓᎴ ᎩᎶ ᎤᏑᎶ ᎤᏑᎳᏅᎢ.

source: When did you quit smoking?
chr: ᎯᎳᏴ ᏧᎵᎪᏤ ᎰᎦᏍᎬ?

source: What length of pants do you wear?
chr: ᎯᎳ ᎢᎦᏅᎯᏓ ᎠᏑᎶ ᎭᏑᎵᏍᎪ?

source: Do you know how to make gravy?
chr: ᎯᎦᏔᎭᏍ ᎠᏑᏍᏗ ᏦᏢᏗ?

source: Choose the one that you want.
chr: ᎭᏑᏯᎩ ᎢᏳᏍᏗ ᏣᏚᎵᏍᎬᎢ.

source: Stir the soup.
chr: ᎭᏑᏴᎳ Ꮎ ᎤᎦᎹ.

source: When Cherokees cook wild onions, they mix them with eggs.
chr: ᏒᎩ ᎢᎾᎨ ᎡᎯ ᏳᏅᏂᏍᏔᎾ ᎠᏂᏣᎳᎩ, ᏧᏪᏥ ᏓᎾᏑᏴᏍᎪᎢ.

source: Something smells bad.
chr: ᎪᏍᏗ ᎤᏲ ᎠᏒᎦ.

source: Do you know anyone who works in a sawmill?
chr: ᎯᏲᎵᎩᏍ ᎩᎶ ᎠᏒᏆᎶᏍᎩ ᏧᎸᏫᏍᏓᏁᎯ?

source: When it flooded, the water destroyed some of the bridges.
chr: ᎤᏃᎱᎦᎾ ᎢᎦᏓ ᏓᏒᏢ ᏚᏲᏍᏔᏅ ᎠᎹ.

source: He burned his hand when he touched a hot stove.
chr: ᎤᏬᏰᏂ ᎤᎴᏴᏒ ᎤᏗᏞᎩ ᎣᏏ ᎤᏒᏂᎳ.

source: It used up one gallon of oil. He drank up a glass full of milk.
chr: ᏑᏟᎶᏓ ᎪᎢ ᎤᏒᏅᎢ. ᎤᎸᏌᏗ ᎧᎵ ᎤᏅᏗ ᎤᏒᏅᎢ.

source: My grandmother was a Nighthawk.
chr: ᎡᎵᏏ ᎠᏒᏃᏱ ᎨᏒᎢ.

source: This boy likes to talk to young women.
chr: ᎯᎠ ᎠᏧᏣ ᎠᎾᏔ ᏧᏟᏃᎮᏙᏗ ᎤᎸᏉᏗ.

source: Do you know what rage is?
chr: ᏣᏅᏔᏍ ᎢᏳᏍᏗ ᎨᏒ ᎠᏔᏝᏬᎯᏍᏗ?

source: He held his breath for two minutes.
chr: ᏔᎵ ᎢᏯᏔᏬᏍᏔᏅ ᎢᎪᎯᏓ ᎤᏔᏬᏍᏔᏅᎢ.

source: Moor the boat when you're through fishing.
chr: ᎯᏔᎳᏛ Ꮎ ᏥᏳ ᎭᏑᏃᏅᎢ.

source: He drilled a hole in the board with a drill.
chr: ᏗᏔᎴᏍᏗ ᎬᏗ ᎤᏔᎴᏒ ᏯᏖᎾ.

source: Fill the holes in the road with gravel.
chr: ᏅᏯ ᏧᎾᏍᏗ ᎬᏗ ᏘᎧᎵᏣ ᏓᏔᎴᏒ ᏅᏃᎯ.

source: When you heat water to its boiling point, it steams.
chr: ᏫᎬᎵᏗᏍᎩ ᏯᏙᏔᎾ ᎠᎹ ᎠᏔᏃᎴᎪᎢ.

source: How old is your teenage daughter?
chr: ᎯᎳ ᎢᏳᏕᏘᏴᏓ ᏤᏥ ᎠᏔᏄᏣ?

source: When he threw the gunpowder into the fire, it exploded.
chr: ᎪᏛ ᏭᏗᎾ ᎠᏓᏪᎳᎩᏍᎩ ᎤᏔᏍᎩᏒᎢ.

source: On July fourth people fire firecrackers.
chr: ᎧᏰᏉᎾ ᏅᎩᏁ ᏗᏔᏍᎩᏍᎩ ᏓᏂᏔᏍᎩᏗᏍᎪ ᏴᏫ.

source: It's dangerous to smoke near a place where explosives are stored.
chr: ᎦᎾᏰᎪ ᎪᎦᏍᏗ ᏗᏔᏍᎩᏍᎩ ᏓᏍᏆᏂᎪᏛ ᎾᎥᎢ.

source: She kissed her daughter on the forehead.
chr: ᎤᏪᏥ ᎠᎨᏳᏣ ᎠᎬᏓᎨᏂ ᎤᏔᏪᏙᏅᎢ.

source: She's combing her son's hair.
chr: ᎤᏪᏥ ᎠᏧᏣ ᎠᏔᏬᎠ.

source: Don't be afraid to ask for it.
chr: ᏞᏍᏗ ᏱᏍᎦᎮᏍᏗ ᏣᏔᏲᏍᏗᎢ.

source: He wants to join the military service.
chr: ᎠᏂᏲᏍᎩ ᎤᏖᎳᏗᏍᏗ ᎤᏚᎵᎭ.

source: She is washing dishes.
chr: ᏗᏖᎵᏙ ᏕᎬᏗᏰᎠ.

source: Don't shake the ladder.
chr: ᏞᏍᏗ ᏥᎯᏖᎸᏂ ᎠᏴᏠ.

source: She made a shirt for her husband to wear.
chr: ᎠᏘᏟᏗ ᎤᏬᏢᏅ ᎠᏂᏁᎵ ᎤᎿᏬᏍᏗ.

source: He's leading a blind man.
chr: ᏗᎨᏫ ᎠᏍᎦᏯ ᎠᏘᏂ.

source: Why do you like to argue?
chr: ᎦᏙ ᏥᏣᎸᏉᏗ ᏣᏘᏲᏍᏗ?

source: He's always looking for an argument.
chr: ᏂᎪᎯᎸ ᎠᏘᏲᏍᏗ ᎤᏲᎰᎢ.

source: Someone is running in this direction.
chr: ᎩᎶ ᏛᏟ.

source: Who would win if you two raced?
chr: ᎦᎪ ᏱᏓᏓᎩᏯ ᏱᏍᏓᏙᎩᏯ?

source: The man making he speech is a candidate for president of the United States.
chr: Ꮎ ᎠᏍᎦᏯ ᏥᎦᏬᏂ ᎠᎹᏰᏟ ᎤᎬᏫᏳᎯ ᏱᎦᎵᏍᏗᏍᎩ ᎠᏙᎩᏯᏍᎩ.

source: Is this camera borrowed?
chr: ᎠᏙᎵᏓᏍ ᎯᎠ ᏗᏓᏟᎶᏍᏗᏍᎩ?

source: Who loaned him the car?
chr: ᎦᎪ ᎤᏙᎵᏍᏔᏁᎢ Ꮎ ᏓᏆᎴᎳ?

source: How long does he want to borrow it?
chr: ᎯᎳ ᎢᎪᎯᏓ ᎤᏙᏟᏍᏗ ᎤᏚᎵ?

source: I see something flashing.
chr: ᎪᎱᏍᏗ ᎠᏙᏯᏩᏍᎬ ᏥᎪᏩᏘᎭ.

source: He took a bite of cornbread.
chr: ᏎᎷ ᎦᏚ ᎤᏥᏍᏕᎥᎢ.

source: Are you lying to me?
chr: ᏍᏆᏥᎪᏁᎭᏍ?

source: He doesn't like to take a drink.
chr: Ꮭ ᏳᎸᏉᏗ ᎤᏚᎩᏍᏗ.

source: He gave him a drink.
chr: ᎠᏚᎩᏍᏗ ᎤᏁᏁᎸᎢ.

source: He promised to come over next month.
chr: ᏐᎢ ᎦᎴᏍᏗ ᎤᏪᏓᏍᏗ ᎤᏚᎢᏍᏔᏅᎢ.

source: I listened to him speak for ten minutes.
chr: ᏍᎪᎯ ᎢᏯᏔᏬᏍᏔᏅ ᎢᎪᎯᏓ ᏥᏯᏛᏓᏍᏔᏅ ᎦᏬᏂᏍᎬᎢ.

source: Ask him what he's going to do.
chr: ᎯᏯᏛᏛᎲᎦ ᏂᏗᏛᏁᎵᏒᎢ.

source: He hears only when you speak loud.
chr: ᏍᏓᏯ ᏱᎦᏬᏂᏌ ᎩᎳ ᎠᏛᎩᏍᎪᎢ.

source: She grows beautiful flowers.
chr: ᏧᏃᏚᎯ ᎠᏂᏥᎸᏍᎩ ᏓᏛᎯᏍᏗᏍᎪᎢ.

source: He is really growing.
chr: ᎤᏙᎯᏳ ᎠᏛᏍᎦ.

source: Do you recognize that young man?
chr: ᎯᏲᎵᎦᏍ Ꮎ ᎠᏫᎾ?

source: I didn't know you had two teenage boys.
chr: Ꮭ ᏯᏆᏅᏖ ᎠᏂᏔᎵ ᎠᏂᏫᏄᏣ ᏕᏣᎧᎲᎢ.

source: Eagles build their nests on mountain tops.
chr: ᎣᏓᎸ ᎦᎸᎳᏗ ᏓᎾᏁᏍᏓᏝᎲᏍᎪ ᎠᏬᎭᎵ.

source: Which room is he in?
chr: ᎦᏙ ᎤᏍᏗ ᎧᏅᏑᎸ ᎠᏯᎠ.

source: He was walking fast.
chr: ᎠᏯᏄᎵ ᎠᎢᏒᎢ.

source: He distributed food among a lot of people.
chr: ᏥᏈᏍᏗ ᏄᎾᏛᏅ ᏴᏫ ᎤᏯᏙᏢ ᎠᎵᏍᏓᏴᏗ.

source: He became a deacon on August 25, 1973.
chr: ᎦᎶᏂ ᏔᎵᏍᎪ ᎯᏍᎩᏁ, ᏐᏁᎳᏚ ᎢᏍᎪᎯᏥᏆ ᎦᏟᏆᏍᎪ ᏦᎢ ᎠᏯᏙᎯᎯ ᏄᎵᏍᏔᏅᎢ.

source: Which chapter are you reading?
chr: ᎯᎳ ᎠᏯᏙᏢ ᎯᎪᎵᏰᎠ?

source: When he was told to wake up, he woke up.
chr: ᎯᏰᎩ ᎠᎪᏎᎳ, ᎤᏰᏨᎢ.

source: Sit here in the middle.
chr: ᎠᎭᏂ ᎠᏰᏟ ᏦᏞᏍᏗ.

source: Don't wake the baby.
chr: ᏞᏍᏗ ᏥᎯᏰᎢᏍᏔᏂ ᎤᏍᏗᎢ.

source: He burned half of his body.
chr: ᎠᏰᏟ ᎢᏴ ᎠᏰᎸ ᏚᎴᏴᏒᎢ.

source: He put the horse inside the barn.
chr: ᏐᏈᎵ ᎤᏂᏴᏍᏗ ᎤᏴᏔᏅ ᏐᏈᎵ.

source: Have you heard a hen crowing?
chr: ᏣᏛᎦᏅᎢᏍ ᏥᏔᎦ ᎠᎩᏏ ᎠᏴᎬᎢ?

source: He got five new pencils from the store. She picked up a pencil from the ground.
chr: ᎯᏍᎩ ᏗᏤ ᏗᎪᏪᎶᏗ ᏚᏴᎲᏗᏓ ᎾᏅᎢ. ᎡᎳᏗ ᏩᏯ ᏗᎪᏪᎶᏗ.

source: She accidently spilled water on the floor.
chr: ᎠᎹ ᎤᏤᏩᏍᏙᏔᏅ ᎠᏙᏓᏝᎲᎢ.

source: The bottle broke when it dropped.
chr: ᎫᎫ ᎤᏲᏨ ᎤᏬᎰᏌ.

source: The hunter shot a dear with an arrow.
chr: ᎦᏃᎭᎵᏙ ᎦᏟᏓ ᎬᏗ ᎤᏲᏢ ᎠᏫ.

source: What time do you take a break from your work.
chr: ᎯᎳ ᎠᏟᎢᎵᏒ ᎯᏲᎯᏍᏗᏍᎪ ᏕᏣᎸᏫᏍᏓᏁᎲ?

source: The children are playing ball. He picked up some small rocks.
chr: ᏗᏂᏲᏟ ᏍᏆᎴᏍᏗ ᏓᎾᏁᎶᎲᏍᎦ. ᏗᏲᏟ ᏅᏯ ᏚᏭᏖᏒᎢ.

source: Several men are hewing railroad ties.
chr: ᎢᎸᏍᎩ ᎢᏯᏂᎢ ᎠᏂᏍᎦᏯ ᏗᏗᏍᏗ ᏓᏂᏲᏢᏍᎦ.

source: No one hides from death.
chr: Ꮭ ᎩᎶ ᏴᎬᏗᏍᎦᎳᏍ ᎠᏲᎱᎯᏍᏗ.

source: When did he die?
chr: ᎯᎳ ᎢᏴ ᏥᎨᏒ ᎤᏲᎱᏎᎢ?

source: He broke up a fight between the little boys.
chr: ᏧᎾᏍᏗ ᎠᏂᏧᏣ ᎠᎾᏟᎲ ᎤᏲᎢᏍᏔᏅᎢ.

source: Every time he sees me, he greets me.
chr: ᏂᎪᎯᎸ ᏯᎩᎪᎭ ᎠᎩᏲᎵᎰᎢ.

source: He accidently broke a water glass.
chr: ᎠᎹ ᎠᏟᏍᏙᏗ ᎤᎸᏌᏗ ᎤᏲᏍᏙᏔᏅᎢ.

source: I was a soldier for three years.
chr: ᏦᎢ ᏧᏖᏗᏴᏓ ᏥᏲᏍᎩ ᎨᏒᎢ.

source: The wind destroyed the small building.
chr: ᎤᏟᏂᎩᏓ ᎦᏃᎸᏍᎬ ᎤᏲᏍᏔᏃᎲ ᎤᏍᏗ ᎠᏓᏁᎸᎢ.

source: a crippled man asked for a walking cane.
chr: ᎠᏲᎤᏟ ᎠᏍᎦᏯ ᎠᏙᎳᏅᏍᏗ ᎤᏔᏲᎸᎢ.

source: Do you want me to go?
chr: ᎠᏯᏍ ᎠᏇᏅᏍᏗ ᏣᏚᎵ?

source: I entered the house when the rain came.
chr: ᎦᎵᏦᏕ ᎠᎩᏴᏢ ᎤᎦᎿᏂᏝ.

source: The boy found a new bat.
chr: Ꮎ ᎠᏧᏣ ᎢᏤ ᎪᏍᏛᏂᏍᏗ ᎤᏴᏩᏛᎲᎢ.

source: Where are you taking the wood?
chr: ᎭᏢ ᏕᎯᏴᏫᏗ ᎠᏓ?

source: There is a gate at the entrance to the pasture.
chr: ᏍᏚᏗ ᎬᏙᎠ ᎠᏴᏍᏙᏗ ᏠᎨᏏ.

source: What are the people doing?
chr: ᎦᏙ ᎠᎾᏛᏁ ᎠᏂᏴᏫ?

source: This boy is a full-blooded Indian.
chr: ᎯᎠ ᎠᏧᏣ ᎠᎧᎵ ᎠᏴᏫᏯᎢ.

source: Have you heard a white person speak Cherokee?
chr: ᏣᏛᎦᏅᎢᏍ ᎠᏲᏁᎦ ᏣᎳᎩ ᎦᏬᏂᏍᎬ?

source: Give him eight dollars.
chr: ᏣᏁᎳ ᎠᏕᎸ ᏘᎥᏏ.

source: He burns coal in his heating stove.
chr: ᏥᏃᏍᎦ ᎠᎪᎲᏍᏗᏍᎪ ᎣᏏ ᎤᎦᎾᏬᎯᏍᏗᎢ.

source: Do you have some flea killer?
chr: ᏧᎦᏍ ᏗᎮᏍᏙᏗ ᏣᏁᎭ?

source: He made an X on the signature line because he didn't know how to write his name in English.
chr: ᏚᏙᎥ ᎤᏬᏪᎶᏗ ᎠᏍᏓᏅᏅ ᏚᏓᎿᏫᏍᏔᏅᎢ ᎾᎦᏔᎲᎾ ᎨᏒ ᎢᏳᏍᏗ ᎩᎵᏏ ᎤᏬᏪᎶᏗᎢ.

source: They met at a crossroads.
chr: ᏓᏓᎿᏫᏍᏛ ᏅᏃᎯ ᏚᎾᏠᏒᎢ.

source: He looked for his conjuring material when he was asked to conjure.
chr: ᏓᏓᏁᏎᏍᎬ ᎤᏮᏔᏂᏓᏍᏗ ᎤᏯᎸ ᏧᏓᏁᏎᏍᏗ ᎠᏥᏔᏲᏎᎳ.

source: Do you think he is going to accept?
chr: ᏚᏛᏓᏂᎸᏥᏍ ᎮᎵ?

source: Why didn't you dodge?
chr: ᎦᏙᎲ Ꮭ ᏱᏙᏣᏓᏅᏗᏍᏔᏁ?

source: The preacher performed baptism on a cold day.
chr: ᎤᏴᏟ ᎢᎦ ᏚᏓᏬᎥ ᎠᎵᏣᏙᎲᏍᎩ.

source: He lasted a long time, then he gave up.
chr: ᎪᎯᏓ ᏚᏪᏘᏅ ᎩᎳ ᏚᏓᏲᏒᎢ.

source: She teaches summer school.
chr: ᎪᎩ ᏓᎾᏕᏠᏆᏍᎬ ᏓᏕᏲᎲᏍᎪᎢ.

source: The shortest verse in the bible says, "Jesus wept."
chr: ᏩᏍᏆᎳᎯᏴ ᎤᏓᏡᎬ ᎦᎸᏉᏗ ᎪᏪᎵ, "ᏥᏌ ᏚᏠᎯᎸᎢ," ᎠᏗᎭ.

source: They were married in a chapel last month.
chr: ᏧᏂᎳᏫᏍᏗ ᏕᎨᎦᏨᏍᏔᏅ ᏐᎢ ᏥᎧᎸᎢ.

source: They make necklaces out of pearls.
chr: ᏗᏯᎵᏗ ᏓᏃᏢᏅᏗᏍᎪᎢ ᏓᎬᎾ.

source: Whatever price you set, I'll pay you.
chr: ᏂᎦᎵᏍᏔᏅᏊ ᎢᎦ ᏕᎯᎬᏩᎶᏔᏅ ᎬᏯᏈᏴᎡᎸᎢ.

source: When he gets to town, the man is going to buy a car.
chr: ᏗᎦᏚᎲ ᏫᎦᎷᏨ ᎠᏍᎦᏯ, ᏓᏆᎴᎳ ᏓᏳᏩᏏ.

source: She saw a rocking chair rocking by itself.
chr: ᎦᏍᎩᎶ ᏗᏟᎨᏍᎩ ᎤᏩᏌ ᏓᏟᎨᏍᎬ ᎤᎪᎲᎢ.

source: He drew a picture of a bear.
chr: ᏲᎾ ᏚᏟᎶᏍᏔᏅᎢ?

source: I was conversing on the phone.
chr: ᏗᏟᏃᎮᏗ ᏕᎦᎵᏃᎮᏍᎬᎢ.

source: How high can you jump?
chr: ᎯᎳ ᎢᏯᎦᎸᎳᏗ ᎡᎵᏊ ᏱᏕᎭliᏔᏚᎦ.

source: Do you think that war will ever cease?
chr: ᎢᎸᎯᏳᎢᏍ ᏙᎢ ᏂᏓᎦᎵᏍᏔᏂ ᎮᎵ ᏓᎿᏩ?

source: He changed his wet clothes.
chr: ᏗᎦᏚᎵᏓ ᏚᏄᏮ ᏚᎿᏩᎢᏴᏒᎢ.

source: I am undressing to go to sleep.
chr: ᏕᎦᏂᏪᎠ ᎠᎩᏒᏍᏗ ᎤᎬᏩᏟ.

source: Put on some clean clothes.
chr: ᏧᏓᏅᎦᎸᏓ ᏔᎿᏬᏣ.

source: Is there a stompground near Vian?
chr: ᏓᏄgo ᎾᎥ ᎪᏢ ᎦᏘᏲᎢ.

source: He put green wood into the stove.
chr: ᏗᏤ ᎠᏓ ᏚᎲᏔᏅ ᎣᏏᎢ.

source: Don't tickle me while I'm eating.
chr: ᏞᏍᏗ ᏥᏙᏍᎩᏴᎩ ᎦᎵᏍᏓᏴᎲᏍᎬᎢ.

source: Which one is better?
chr: ᎦᏙ ᎤᏍᏗ ᏓᏤᏝ.

source: He couldn’t get up from a squatting position.
chr: ᎤᏄᎸᏅ ᏧᎴᏗ ᏕᎦᏥᏡᎬᎢ.

source: He is tying my shoe laces for me.
chr: ᏓᏆᎸᏌᏛ ᏓᎩᎧᏁᎮᎭ.

source: He untied his shoes when he took them off .
chr: ᏚᎳᏍᏑᏢ ᏚᎧᏁᏴᎲ ᏚᎳᏑᎴᏌ.

source: Who is looking after you?
chr: ᎦᎪ ᏕᏣᎧᏃᏩᏗᏙᎭ?

source: If you're in the dark for a long time, you'll become blind.
chr: ᎪᎯᏓ ᎤᎵᏏᎬ ᏴᏯᎠ ᏱᏛᎨᏩᎩ.

source: I saw a terrapin crossing the road.
chr: ᏓᎩᏏ ᏅᏃᎯ ᏚᎾᏗᏫᏏᏗᏒ ᏥᎪᏩᏔ.

source: He opened the lock with a wire.
chr: ᎤᏯᏅ ᎬᏗ ᎤᏍᏚᎢᏒ ᏓᎩᏏ.

source: The electrical wires smoked when they became hot.
chr: ᏗᎾᎦᎵᏍᎩ ᏧᏯᏅ ᏚᎦᏒᏍᏔᏅ ᏚᏖᏴᏌ.

source: She was blinking because she had tears in her eyes.
chr: ᏚᎦᎳᏁᏒ ᎢᏳᏍᏗ ᏓᎦᏔᎾᏩᏍᎬᎢ.

source: He closed his eyes when he was blinded by a bright light.
chr: ᏚᎦᏔᏍᏔᏅ ᎤᏍᎪᏍᏗ ᎠᏨᏍᏛ ᏚᎦᏙᏴᏌ.

source: A lion attacked the lion tamer.
chr: ᏢᏓᏥ ᏗᏏᎾᎲᏍᏗᏍᎩ ᏢᏓᏥ ᏚᎦᏘᎸᏒᎢ.

source: When she takes off her glasses, she doesn't see well.
chr: ᏱᏚᎦᏘᏅᏕᏌ Ꮭ ᎣᏍᏓ ᏯᎪᏩᏘᏍᎪᎢ.

source: When some people are in the sun, they put on dark glasses.
chr: ᎢᎦᏓ ᎠᎦᎵᏍᎬ ᏯᏁᏙᎭ ᏧᎵᏏᎩ ᏗᎦᏘᏅᏘᏗ ᏓᎾᎦᏘᏅᏛᏍᎪᎢ.

source: He shelled a bushel of corn for the horse to eat.
chr: ᏚᏟᎶᏓ ᎢᎦ ᏎᎷ ᏚᎦᏢᎲ ᏐᏈᎵ ᎤᎩᏍᏗ.

source: Who was snoring last night?
chr: ᎦᎪ ᏓᏆᎳᎩᏍᎨ ᎤᏒ ᏥᎨᏒ?

source: She is sprinkling water on the clothes she is going to iron.
chr: ᎠᎹ ᏓᏆᏲᎥᏍᎦ ᏗᎿᏬ ᏧᏖᏍᏗ.

source: Do you like turnips?
chr: ᏓᏈᏌᏂᏍ ᏗᏣᎸᏉᏗ?

source: A cat caught a woodpecker.
chr: ᏓᎳᎳ ᎤᏂᏴᎲ ᏪᏌ.

source: Bill wants to put on some new shoes.
chr: ᏗᏤ ᏗᎳᏑᎶ ᏧᎳᏑᏢᏗ ᎤᏚᎵ ᏫᎵ.

source: He changed shoes because they were too long
chr: ᏚᎳᏑᎳᎢᏴᏒ ᏗᎦᏅᎯᏗ ᎨᏒ ᎢᏳᏍᏗ ᏗᎳᏑᎳ.

source: Take your right shoe off.
chr: ᎠᎦᏘᏏ ᏗᏜ ᏣᎳᏑᏢ ᎭᎳᏑᎳᎩ.

source: If he can't get up, help him up.
chr: ᎤᏄᎸᎲᏍᎨᏍᏗ ᏧᎴᏗ ᏕᎯᏯᎴᏔᏅᎢ.

source: He's recuperating in a hospital.
chr: ᏧᏂᏢᎩ ᏩᏯᎥ ᏓᎴᎯᏏᎭ.

source: When I say stand up, everyone stand up.
chr: ᏗᏣᎴᎲᎦ ᎦᏛᏅ, ᏂᎦᏓ ᏕᏣᎴᏅᎢ.

source: Tahlequah is the capitol of the Cherokee Nation of Oklahoma.
chr: ᏓᎵᏆ ᏣᎳᎩ ᎠᏰᏟ ᎤᏙᏢᏒᎢ ᎣᎦᎵᎰᎻ.

source: I'm going to take my gloves off. What about you?
chr: ᏙᏓᎦᎵᏰᏑᎴᏏ. ᏂᎯᎾ?

source: I am putting on gloves because I am going to work.
chr: ᏕᎦᎵᏰᏑᎵ ᏙᏛᎩᎸᏫᏍᏓᏁᎵᎮᏃ

source: He took off his shoes and socks.
chr: ᏚᎳᏑᎴᏒ ᎠᎴ ᏚᎵᏲᎩᏒᎢ

source: While he was putting on his socks, someone stole his shoes.
chr: ᏓᎵᏲᎯᎲ ᎢᎪᎯᏓ ᎩᎶ ᏚᏃᏍᎩᏎ ᏧᎳᏑᎶ.

source: Change your wet socks.
chr: ᏔᎵᏲᏌ ᏗᎦᏚᎵᏓ ᏕᏣᎵᏲᎲᎢ.

source: Don't aim at anyone with a gun.
chr: ᏞᏍᏗ ᎩᎶ ᎦᎶᏇ ᎬᏗ ᏱᏘᏯᎵᏐᏍᏗᏍᎨᏍᏗ.

source: A horsefly bites hard.
chr: ᏓᎹᎦ ᏍᏓᏯ ᎠᏓᏍᎦᎵᎪᎢ

source: They will be having a trial on Monday.
chr: ᎤᎾᏙᏓᏉᏅ ᏓᎾᏓᎯᎵᏙᎮᏍᏗ.

source: A lot of Cherokees met at Tahlequah in order to hear the chief speak .
chr: ᏥᏈᏍᏗ ᎠᏂᏣᎳᎩ ᏚᎾᏠᏒ ᏓᎵᏆ ᎤᎬᏫᏴᎯ ᎦᏬᏂᏍᎬ ᎤᎾᏛᎪᏗ ᎤᏂᏰᎸᏒᎢ.

source: Why did they separate?
chr: ᎦᏙᎲ ᏚᎾᎦᎴᏅᎮᎢ?

source: What is the little boy playing with?
chr: ᎦᏙ ᎤᏍᏗ ᏓᏁᎶᏗ Ꮎ ᎤᏍᏗ ᎠᏧᏣ?

source: I'm going to play ball all day tomorrow
chr: ᏍᏆᏞᏍᏗ ᏙᏓᎦᏁᎶᏂ ᏑᎾᎴ ᎤᏙᏓᏆᏓ

source: Cherokee hold church services on Saturday nights.
chr: ᎠᏂᏣᎳᎩ ᎤᏙᏓᏈᏕᎾ ᎤᏒ ᏓᏂᎳᏫᎪᎢ.

source: What did you get for Christmas?
chr: ᎦᏙ ᎤᏍᏗ ᏣᎩᏎ ᏓᏂᏍᏓᏲᎯᎲᎢ?

source: When are they going to adjourn?
chr: ᎯᎳ ᎢᏴ ᏙᏛᏂᏰᎵᏍᏗ?

source: He barely shot the gun because the trigger was hard to pull.
chr: ᏎᎦᏨ ᏚᏍᏓᏲᏢ ᎦᎶᏇ ᎠᏍᏓᏴ ᎪᏣᏁᏍᏗᎢ ᎢᏳᏍᏗ.

source: He's splitting some cook wood.
chr: ᎣᏏ ᎠᏓᏍᏓᏴᏗ ᏧᎲᏘᏗ ᎠᏓ ᏓᏍᏡᏍᎦ.

source: I am sprinkling water on my cucumbers.
chr: ᎦᎦᎹ ᏓᎩᏫᏒ ᎠᎹ ᏕᏥᏍᏚᏟᎠ.

source: The treasurer is counting money.
chr: ᎠᏕᎳ ᎠᎦᏘᏱ ᎠᏕᎳ ᏓᏎᎯᎭ.

source: He curses when something makes him angry.
chr: ᏓᏍᎩᎾᏗᏍᎪ ᎪᏍᏗ ᏳᎿᎸᏍᏔᎾ.

source: When the president finished his speech, the people applauded.
chr: ᎤᎬᏫᏳᎯ ᎤᏬᏂᏐᎿ ᏚᎾᏏᏛᏂᎸ ᏴᏫ.

source: Don't work so hard or you'll get exhausted.
chr: ᏞᏍᏗ ᎥᏍᎩ ᎢᏍᏓᏱ ᏱᏗᏣᎸᏫᏍᏓᏁᎮᏍᏗ, ᏙᏔᏍᏔᏰᏏᏍ.

source: When it becomes light, the dog barks.
chr: ᎤᏒ ᏱᏄᎵᏍᏔᎾ, ᎩᏟ ᏓᏑᏫᏍᎪᎢ.

source: He scheduled his speech for Monday night when asked to speak.
chr: ᎤᎾᏙᏓᏉᏅ ᎤᏒ ᎤᏬᏂᎯᏍᏗ ᏚᏒᏍᏔᏅᎢ ᎬᏩᏔᏲᏎᎳ ᎤᏬᏂᎯᏍᏗᎢ.

source: What time did you start ironing?
chr: ᎯᎳ ᎠᏟᎢᎵᏒ ᏣᎴᏅᎮ ᏕᎯᏖᏍᎬᎢ?

source: He found an arrowhead made out of flint.
chr: ᏓᏫᏍᎦᎳ ᎪᏢᏔᏅ ᎦᏟᏓ ᎤᏍᎧ ᎤᏩᏛᎲᎢ

source: When it freezes, the roads get slippery.
chr: ᏳᏁᏍᏓᎳᏓ ᏕᎦᏅᏅ ᏓᏫᏍᎬᎯ ᏂᏕᎦᎵᏍᏗᏍᎪᎢ.

source: Some mushrooms are good to eat but others are poisonous.
chr: ᎢᎦᏓ ᏓᏬᎵ ᎠᏃᏍᏓ ᏗᎦᏰᏍᏗ ᎢᎦᏓᏃ ᎠᎾᏓᎯᎯ.

source: He stopped the leak in the tub with a cork.
chr: ᏓᏬᎵᏳᏍᏗ ᎬᏗ ᎤᏍᏚᏅᎢ ᏒᏙᏂ ᎬᎫᏍᎬᎢ.

source: Let the rabbit go.
chr: ᏘᏲᎯ ᏥᏍᏚ.

source: She picked a sack full of hickory nuts.
chr: ᏕᎦᎵᏗ ᎧᎵ ᏚᏭᏖᏒ ᏐᎢ.

source: He slammed the door when he went out.
chr: ᏍᏚᏗ ᏚᎸᏛᏂᏍᏔᏅ ᎤᏅᎪᏣ.

source: I saw a deer crossing a road last night.
chr: ᏅᏃᎯ ᏕᎦᎾᏗᏫᏍᎬ ᏥᎪᎥ ᎠᏫ ᎤᏒ ᏥᎨᏒᎢ.

source: I want to announce something.
chr: ᎪᎱᏍᏗ ᏗᎩᏃᏣᏢᏗ ᎠᏆᏚᎵᎭ.

source: I crossed the ocean when I was in the military service.
chr: ᎠᎺᏉ ᏓᎩᏐᏨ ᎠᏂᏲᏍᎩ ᏥᏥᏯᎥᎢ.

source: He endured working in the heat all day.
chr: ᎤᏙᏓᏆᏓ ᏚᏪᏘᏅ ᎤᏗᏞᎩ ᏚᎸᏫᏍᏓᏁᎲᎢ.

source: The Sunday School teacher explained what they had read.
chr: ᎤᎾᏙᏓᏆᏍᎬ ᏗᎾᏕᏠᏆᏍᎩ ᏗᎨᏲᎲᏍᎩ ᏚᏬᏏᏌᏅ ᎤᏂᎪᎵᏰᎥᎢ.

source: He decided too quickly.
chr: ᎤᏟᏍᏗ ᏚᏭᎪᏔᏅᎢ.

source: She washes the dishes immediately after they finish eating.
chr: ᏳᎾᎵᏍᏓᏰᏃᎿᏊ ᏕᎬᏗᏰᏍᎪ ᏗᏖᎵᏙᎢ.

source: She's shelling peas. How many hickory nuts are you going to shell?
chr: ᏚᏳᎾᏍᏗ ᏕᎬᏙᎯᎠ. ᎯᎳ ᎢᎦ ᏐᎯ ᏙᏛᏙᎯᏏ?

source: Summer begins in the month of June.
chr: ᏕᎭᎷᏱ ᎧᎸ ᎠᏓᎴᏂᏍᎪᎢ ᎪᎩ.

source: When he went around the curve too fast, he turned the car over.
chr: ᎦᏣᏄᎵ ᎤᏩᏕᏯᏍᏔᎾ ᎠᏕᏲᎲ ᏚᏟᏆᏗᏅᏒ ᏓᏆᎴᎳ.

source: The singers sang all night.
chr: ᎤᎵᏨᏓᏆᏓ ᏚᏂᏃᎩᏒ ᏗᏂᏃᎩᏍᎩ.

source: The cat clawed him with its sharp claws.
chr: ᏗᎪᏍᏓᏯ ᏚᏑᎦᏢ ᎬᏗ ᏚᏄᎪᏒ ᏪᏌ.

source: What are you doing, washing?
chr: ᎦᏙ ᎭᏛᏁ, ᏕᎲᎩᎶᎠᏍ?

source: Where did marriage begin?
chr: ᎭᏢ ᏧᏓᎴᏅᎮ ᏗᏨᏍᏗ?

source: The murderer was taken to jail when he was caught.
chr: ᏧᎾᏓᏍᏚᏗ ᎠᎦᏘᏅᏒ ᏗᏓᎯᎯ ᎠᏥᏂᏴᎭ.

source: The lawyer is going to the courthouse.
chr: ᏧᎾᏓᎯᎵᏓᏍᏗ ᎡᎦ ᏗᏘᏲᎯᎯ.

source: A photographer came to the ball game.
chr: ᏗᏓᏟᎶᏍᏗᏍᎩ ᎤᎷᏨ ᎠᎾᎳᏍᎦᎵᏍᎬᎢ

source: Whose photograph is this?
chr: ᎦᎪ ᎤᏤᎵ ᎯᎠ ᏗᏓᏟᎶᏍᏔᏅᎢ?

source: Some graves have crosses.
chr: ᎢᎦᏓ ᏓᏤᎵᏍᏛ ᏧᏓᎿᏫᏓ ᏕᎨᏙᎢ.

source: Do you know where a conjurer lives?
chr: ᏣᏅᏔᏍ ᎤᎿ ᎦᏁᎸ ᏗᏓᏁᏎᏍᎩ?
